In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"istanbul": [30,29, np.nan], "ankara": [20,np.nan, 25], "izmir": [40,39,58]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     58

In [5]:
havaDurumuDataFrame.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     58

In [7]:
havaDurumuDataFrame.dropna(axis=1)

   izmir
0     40
1     39
2     58

In [8]:
yeniVerisi = {"istanbul": [30,29, np.nan], "ankara": [20,np.nan, 25], "izmir": [40,39,58], "antalya": [45, np.nan, np.nan]}
yeniDataFrame = pd.DataFrame(yeniVerisi)

In [9]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     58      NaN

In [11]:
yeniDataFrame.dropna(axis=1, thresh = 2)

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     58

In [12]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     58      NaN

In [13]:
yeniDataFrame.fillna(20)

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     58     20.0